# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Command line tools - Core
brew "stow"           # Symlink farm manager for dotfiles
brew "tmux"           # Terminal multiplexer
brew "neovim"         # Text editor
brew "fzf"            # Fuzzy finder
brew "ripgrep"        # Fast grep
brew "fd"             # Fast find
brew "bat"            # Cat with syntax highlighting
# brew "exa"            # Modern ls replacement - REMOVED, eza is used
brew "jq"             # JSON processor
brew "yq"             # YAML processor
brew "yazi"           # Terminal file manager
brew "btop"           # System monitor
brew "htop"           # Interactive process viewer
brew "lazygit"        # Terminal UI for git
brew "gh"             # GitHub CLI
brew "eza"            # Modern replacement for ls
brew "zoxide"         # Smarter cd command
brew "tldr"           # Simplified man pages
brew "httpie"         # User-friendly HTTP client
brew "wget"           # Internet file retriever
brew "curl"           # Command line tool for transferring data
brew "rsync"          # Fast incremental file transfer
brew "ncdu"           # Disk usage analyzer with ncurses interface
brew "diff-so-fancy"  # Good-looking diffs
brew "p7zip"          # 7-Zip (for .7z in extract function)
brew "unrar"          # Unarchiver for .rar files (for extract function)
brew "dockutil"       # Command line tool for managing Dock items

# Development tools
brew "node"           # JavaScript runtime
brew "python@3.12"    # Python language
brew "lua"            # Lightweight, multi-paradigm scripting language
brew "ast-grep"       # CLI tool for code structural search, lint and rewriting
brew "uv"             # Extremely fast Python package installer and resolver, written in Rust
brew "luajit"         # JIT compiler for Lua
brew "tree-sitter"    # Parser generator tool
brew "git-delta"      # Syntax-highlighting pager for git
brew "shellcheck"     # Shell script static analysis tool
brew "jless"          # Command-line JSON viewer
brew "vim"            # Improved vi text editor (backup for neovim)
brew "pandoc"         # Universal document converter

# Container and virtualization
cask "docker"         # Docker Desktop for Mac
brew "docker-compose" # Multi-container Docker applications

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"

# Applications - Browsers
cask "arc"                 # Primary web browser
cask "google-chrome"       # Secondary browser / Dev tools

# Applications - Productivity
cask "notion"              # Productivity suite
cask "notion-calendar"     # Calendar app (formerly Cron)
cask "notion-mail"         # Email client for Notion
cask "bitwarden"           # Password manager
cask "linear-linear"       # Project management
cask "readwise-reader"     # Read-it-later and RSS
cask "superwhisper"        # AI transcription
cask "raycast"             # Launcher and productivity tool
cask "alt-tab"             # Windows-style alt-tab
cask "shottr"              # Screenshot tool
cask "hiddenbar"           # Hide menu bar icons
cask "meetingbar"          # Next meeting in menu bar

# Applications - Utilities
cask "google-drive"        # Cloud storage
cask "docker"              # Containerization
cask "postman"             # API client
cask "stats"                # System monitor in menu bar

# Applications - AI Tools
# cask "perplexity"         # AI search - Install from Mac App Store
cask "claude"              # AI assistant
cask "chatgpt"             # AI assistant

# Applications - Development
cask "visual-studio-code"  # Code editor
cask "warp"                # Modern terminal
cask "windsurf@next"       # Windsurf IDE
cask "figma"               # Design tool
cask "iterm2"              # Alternative terminal

# Applications - Media & Communication
cask "spotify" # Music streaming - Uncomment if needed
