# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Command line tools - Core
brew "stow"           # Symlink farm manager for dotfiles
brew "tmux"           # Terminal multiplexer
brew "neovim"         # Text editor
brew "fzf"            # Fuzzy finder
brew "ripgrep"        # Fast grep
brew "fd"             # Fast find
brew "jq"             # JSON processor
brew "yq"             # YAML processor
brew "yazi"           # Terminal file manager
brew "btop"           # System monitor
brew "lazygit"        # Terminal UI for git
brew "gh"             # GitHub CLI

# Development tools
brew "node"           # JavaScript runtime
brew "python@3.12"    # Python language
brew "lua"            # Lua language
brew "luajit"         # JIT compiler for Lua
brew "tree-sitter"    # Parser generator tool

# Container and virtualization
brew "colima"         # Container runtime for macOS
brew "docker"         # Containerization platform
brew "docker-compose" # Multi-container Docker applications
brew "lima"           # Linux virtual machines

# Text processing
brew "pandoc"         # Universal document converter

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"

# Applications - Browsers and Development
cask "arc"                # Primary web browser
cask "google-chrome"      # Web browser for development
cask "visual-studio-code" # Code editor
cask "warp"               # Modern terminal

# Applications - Productivity
cask "raycast"            # Productivity and launcher
cask "notion"             # Note-taking and organization
cask "notion-calendar"    # Calendar app
cask "notion-mail"        # Email client
cask "bitwarden"          # Password manager
cask "linear-linear"      # Project management

# Applications - Utilities
cask "google-drive"       # Cloud storage
cask "reader"             # PDF reader
cask "superwhisper"       # Audio transcription

# Applications - AI Tools
cask "chatgpt"            # ChatGPT desktop app
cask "claude"             # Claude desktop app
cask "windsurf@next"      # Codeium Windsurf

# Applications - Document Processing
cask "mactex"             # LaTeX distribution
