# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Command line tools - Core
brew "stow"           # Symlink farm manager for dotfiles
brew "tmux"           # Terminal multiplexer
brew "neovim"         # Text editor
brew "fzf"            # Fuzzy finder
brew "ripgrep"        # Fast grep
brew "fd"             # Fast find
brew "bat"            # Cat with syntax highlighting
brew "exa"            # Modern ls replacement
brew "jq"             # JSON processor
brew "yq"             # YAML processor
brew "yazi"           # Terminal file manager
brew "btop"           # System monitor
brew "htop"           # Interactive process viewer
brew "lazygit"        # Terminal UI for git
brew "gh"             # GitHub CLI
brew "eza"            # Modern replacement for ls
brew "zoxide"         # Smarter cd command
brew "tldr"           # Simplified man pages
brew "httpie"         # User-friendly HTTP client
brew "wget"           # Internet file retriever
brew "curl"           # Command line tool for transferring data
brew "rsync"          # Fast incremental file transfer
brew "ncdu"           # Disk usage analyzer with ncurses interface
brew "diff-so-fancy"  # Good-looking diffs

# Development tools
brew "node"           # JavaScript runtime
brew "python@3.12"    # Python language
brew "lua"            # Lua language
brew "luajit"         # JIT compiler for Lua
brew "tree-sitter"    # Parser generator tool
brew "git-delta"      # Syntax-highlighting pager for git
brew "shellcheck"     # Shell script static analysis tool
brew "jless"          # Command-line JSON viewer
brew "vim"            # Improved vi text editor (backup for neovim)
brew "pandoc"         # Universal document converter

# Container and virtualization
cask "docker"         # Docker Desktop for Mac
brew "docker-compose" # Multi-container Docker applications

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"

# Applications - Browsers and Development
cask "arc"                # Primary web browser
cask "google-chrome"      # Web browser for development
cask "visual-studio-code" # Code editor
cask "windsurf@next"      # Windsurf IDE
cask "warp"               # Modern terminal

# Applications - Productivity
cask "raycast"            # Productivity and launcher
cask "notion"             # Note-taking and organization
cask "notion-calendar"    # Calendar app
cask "notion-mail"        # Email client
cask "bitwarden"          # Password manager
cask "linear-linear"      # Project management

# Applications - Utilities
cask "google-drive"       # Cloud storage
cask "reader"             # PDF reader
cask "superwhisper"       # Audio transcription

# Applications - AI Tools
cask "chatgpt"            # ChatGPT desktop app
cask "claude"             # Claude desktop app
